<template>
  <div>
    <div class="cardraiders">
      <div class="header">
        <img src="http://ioskamidownload.oss-cn-qingdao.aliyuncs.com/yangkabeijing%402x.9d34970.png" mode="widthFix" alt="">
      </div>

      <div class="articleList">
	  
	          <!--科普 | 信用卡到底有什么用？-->
        <div @click="tocardraidersdetails(ms_title,11)">
          <div class="content">
            <div class="content_left">
              <p>科普 | 信用卡到底有什么用？</p>
              <p>想象一下，看上一款尼康相机，但手里没有钱买。于是，你开始拼命存钱，等终于存够了钱，这款相机停产了

</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 7462</span>
            </div>
            <div class="content_right">
              <img src="https://ss2.bdstatic.com/70cFvnSh_Q1YnxGkpoWK1HF6hhy/it/u=3879099796,3374544206&fm=26&gp=0.jpg" mode="widthFix" alt="">
            </div>
          </div>
        </div>
		
			  
	          <!--科普 | 什么样的卡是一张"好卡"？-->
        <div @click="tocardraidersdetails(ms_title,12)">
          <div class="content">
            <div class="content_left">
              <p>什么样的卡是一张"好卡"？</p>
              <p>对于不同的人来说，好卡的标准是不一样的。通常没有十全十美的情况，纠结于找一张完美的卡的结果很可能是犹豫不决最后..</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 7462</span>
            </div>
            <div class="content_right">
              <img src="https://mmbiz.qpic.cn/mmbiz_jpg/5zmuhB1W64buIRHvQgwsU6YVjicm7WaLLMV8JQF1KeLg6Xx5hZibNE2fQ3TU3eiaM4AtxngBawprMZnWlMYcfAIPA/640?wx_fmt=jpeg&tp=webp&wxfrom=5&wx_lazy=1&wx_co=1" mode="widthFix" alt="">
            </div>
          </div>
        </div>
		
		
		
					  
	          <!-- 银行下0额度信用卡，该不该愤而销卡？ -->
        <div @click="tocardraidersdetails(ms_title,13)">
          <div class="content">
            <div class="content_left">
              <p>银行下0额度信用卡，该不该愤而销卡？</p>
              <p>有些小伙伴会有这样的经历：自己申请了个工行信用卡，本以为怎么也能下个几千额度，结果.</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 7462</span>
            </div>
            <div class="content_right">
              <img src="https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=1879652293,3757964995&fm=26&gp=0.jpg" mode="widthFix" alt="">
            </div>
          </div>
        </div>
		
		
		

        <!--交通银行-->
        <div @click="tocardraidersdetails(jt_title,1)">
          <div class="content">
            <div class="content_left">
              <p>交通银行信用卡养卡攻略</p>
              <p>1.  金额数量尽量多，半年内消费总金额至少在额度30% 以上；</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 3530</span>
            </div>
            <div class="content_right">
              <img src="http://image.sudaizhijia.com/production/20170920/bank/20170920151057-269.png" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--建设银行-->
        <div  @click="tocardraidersdetails(js_title,2)">
          <div class="content">
            <div class="content_left">
              <p>建设银行信用卡养卡技巧</p>
              <p>1、 经常刷卡消费，次数越多越好，最好每个月刷完差不多所有额度。</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 6680</span>
            </div>
            <div class="content_right">
              <img src="https://timgsa.baidu.com/timg?image&quality=80&size=b10000_10000&sec=1530103741&di=f9639e4e2b06ca0eedd9d4680fd99b32&src=http://imgsrc.baidu.com/forum/pic/item/7e3e6709c93d70cf4f46d499f8dcd100bba12be1.jpg" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--工商银行-->
        <div @click="tocardraidersdetails(gs_title,3)">
          <div class="content">
            <div class="content_left">
              <p>工商银行-养卡攻略</p>
              <p>1. 多笔消费，比例25/2/1 25笔500元以下，2笔5000 左右，1笔达总卡额度百分之70。（额度太小或者额度较大具体对待）</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 4846</span>
            </div>
            <div class="content_right">
              <img src="http://image.sudaizhijia.com/production/20171012/bank/20171012201435-573.png" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--农业银行-->
        <div @click="tocardraidersdetails(ny_title,4)">
          <div class="content">
            <div class="content_left">
              <p>农业银行养卡攻略</p>
              <p>由于某些历史原因，农行申卡成功率低，额度普遍偏低，而且提额很难，这已经成为卡右的一大共识。好多卡友咨询如何才能提高农行信用卡的额度，今天给大家分享下农行提额的最实用的几个技巧：</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 5721</span>
            </div>
            <div class="content_right">
              <img src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1530113879491&di=5d05f10bd9592aafbb385086f3c39d36&imgtype=0&src=http%3A%2F%2Fpic.90sjimg.com%2Fdesign%2F00%2F07%2F85%2F23%2F59316ca9789ee.png" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--光大银行-->
        <div @click="tocardraidersdetails(gd_title,5)">
          <div class="content">
            <div class="content_left">
              <p>光大银行养卡技巧</p>
              <p>所谓养卡，就是通过一些"技术手段" ，把信用卡额度提上去。一般来说，初始额度1万的信用卡养到5万的额度就自然〃毕业""了。如果手中有几张额度5万元的信用卡，总额 度也能达到几十万。那么，如何正确地养卡提额呢？下面， 就跟大家分享一些养卡的技巧。</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 5541</span>
            </div>
            <div class="content_right">
              <img src="http://image.sudaizhijia.com/production/20170920/bank/20170920151123-331.png" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--广发银行-->
        <div @click="tocardraidersdetails(gf_title,6)">
          <div class="content">
            <div class="content_left">
              <p>广发银行养卡技巧</p>
              <p>以卡养卡，就是A卡消费后，从B卡种来获得现金来还A 卡，等到B卡要还款了，再从A卡获得现金来还B卡，如此循环。信用卡以卡养卡，看起来似乎很简单，但是要注意的地方也还是不少，所以想要卡养得好，就得掌握一些养卡技巧。</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 3096</span>
            </div>
            <div class="content_right">
              <img src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1530113917489&di=34b853bae2e32f903e336b34020d24db&imgtype=0&src=http%3A%2F%2Fpic.90sjimg.com%2Fdesign%2F00%2F07%2F85%2F23%2F59316cbf452df.png" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--中国银行-->
        <div @click="tocardraidersdetails(zg_title,7)">
          <div class="content">
            <div class="content_left">
              <p>中国银行提额方法</p>
              <p>信用卡申请之初，持卡人的信用额度都不是很高的，很多人一张卡用了很久还是初始的倍用额度。实际上呢，信用额度是可以提高的，随着收入、资产条件的提高，完全可以提高信用卡额度，以下八种方式助你成功信用卡提额。</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 11562</span>
            </div>
            <div class="content_right">
              <img src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1530113946255&di=934a7aeb4e34dafb00b70b7fb004927f&imgtype=0&src=http%3A%2F%2Fe.hiphotos.baidu.com%2Fzhidao%2Fpic%2Fitem%2F8326cffc1e178a82e50ad11afd03738da977e852.jpg" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--兴业银行-->
        <div @click="tocardraidersdetails(xy_title,8)">
          <div class="content">
            <div class="content_left">
              <p>兴业银行信用卡养卡技巧</p>
              <p>刷好第一笔，多元化消费，真实消费，少套。按时还兴业银行的卡片要多点真实消费，少用鸡，养卡开商户15-20户左右， 一个月能有10到20笔之间，多刷优质商户。这个优质商户的定义包括银行特约商户和高端知名商户</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 5569</span>
            </div>
            <div class="content_right">
              <img src="http://image.sudaizhijia.com/production/20170920/bank/20170920151004-923.png" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--民生银行-->
        <div @click="tocardraidersdetails(ms_title,9)">
          <div class="content">
            <div class="content_left">
              <p>民生银行信用卡提额攻略</p>
              <p>首次申请提高额度需要使用信用卡满半年以上，保持良好的还款记录，方可申请。首次提额后需要过了6个月以后才可再次申请。对成功提额有帮助的消费方式有：</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 7462</span>
            </div>
            <div class="content_right">
              <img src="https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1530113977790&di=713e4c302531ff87b4783dcdfade2120&imgtype=0&src=http%3A%2F%2Fpic.90sjimg.com%2Fdesign%2F00%2F07%2F85%2F23%2F59316cc45bac5.png" mode="widthFix" alt="">
            </div>
          </div>
        </div>

        <!--华夏银行-->
        <div @click="tocardraidersdetails(hx_title,10)">
          <div class="content">
            <div class="content_left">
              <p>华夏银行养卡</p>
              <p>信用卡养卡，就是有技巧地刷卡，积累良好的刷卡记录，并遵循银行信用卡提额的规则，逐渐提升信用卡额度的过程。信用卡刷卡养卡的目的是为了提升信用卡额度，把低额度信用卡变成大额信用卡，这样持卡人可使用的信用资金就多了，能够满足持卡人资金周转的需求。那么信用卡养卡有哪些技巧呢？</p>
              <span>2018-06-08</span>
              <span><img style="width:30rpx;" src="../../assets/liulan@2x.png" mode="widthFix" alt=""> 9845</span>
            </div>
            <div class="content_right">
              <img src="http://image.sudaizhijia.com/production/20171229/bank/20171229171255-146.png" mode="widthFix" alt="">
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
// import {getBannerImg} from '../../requestAPI/requestAPI';

  //产生随机数函数
  function RndNum(n) {
    let rnd = '';
    for(let i = 0; i < n; i++)
      rnd += Math.floor(Math.random() * 10);
    return rnd;
  }

  export default {
    data () {
      return {
        /*cardUrlList: [],*/
        cardUrl: '',

        watchNum: 1000,//基数
        nowNum: 0,//初始数据

        //交通
        jt_title: '交通银行提额攻略:',
        jt: '提额攻略：\n' +
        '1.  金额数量尽量多，半年内消费总金额至少在额度30% 以上；\n' +
        '2.  消费次数尽量多，平均每月10笔以上，若20笔以上更易提额；\n' +
        '3.  消费商户类型多，诸如商场超市加油站餐饮旅店旅游娱乐场所等；\n' +
        '4.  批发类和购房购车等大宗消费越少提额越容易；\n' +
        '5.  网上购物、支付宝交易及取现越少提高额度申请越易批核；\n' +
        '6.  刷卡的商户类型不能总是与所在公司的经营范围性质类似。\n' +
        '根据信用卡的额度区分也有专门的提额支招：\n' +
        '1.  额度2000-5000 ,这类交通银行持卡应该高频率刷卡消费，多次多笔，经常爆卡存钱刷。这样提额基本可以在三个月就提高一次固定额度，因为是系统评分，每月刷卡次数超过30次以上，三个月提额成功率接近90%。\n' +
        '2.  额度5000-20000 ,这类交通银行持卡下卡是根据你提供的学历、工作证明、社保等的实际资信证明批卡额度，应该怎么样来提额呢，次数一定要少一个星期刷卡次数不要超两次，最好都在1.25类型商户消费，每周在1.25的机器上爆卡，如果卡里额度10000 ,在商户上刷12000这样一定不会刷卡成功，告诉银行有这样的刷卡需求。如果银行举行周周刷活动一定要参加，最好每次在0.78以上费率商户达标，活动过程中可以尝试申请临时额度，活动结束后如果沒有收到银行提额短信，不在使用卡片，放到三个月如果银行不提额，直接注销，等两个月后从新申请额度会提高1.5倍到2倍（此方法信用卡从1万到3万不到1年，成功5例）\n' +
        '3.额度20000-50000 ,这类交通银行持卡人，以上方法都不管用时，境外消费是目前对很多银行通杀的方法，半年两次出国额度从2万多提升到交通白金的客户，有的只出去刷卡一次，回国冷冻卡片两到三个月就收到银行白金邀请码。\n' +
        '(冷冻对20000以上的信用卡效果很好）\n' +
        '还有一些偏门的提额技巧：\n' +
        '最低还款式提额：连续几个月最低还款，说明自己在近期十分需要用钱，并且也可以让银行赚到利息，银行会在这样的客户中根据以往的个人信用情况主动为持卡人提额。\n' +
        '销卡威胁式提额：持卡人可以致电银行客服申请提升额 度，如果不提额就销卡，这种方法比较偏激，但有时候会有效果。此方法慎用，一旦注销，日后要再申请就难了！\n' +
        '临时提额式提额：近期正值节日期间，旅游、购物等需要用钱的地方非常多，持卡人可以申请提升临时额度，交通银行一般都会审批，并且多申请几次临时提额，银行会认为持卡人对信用卡需求大，提升固定额度也不是难事\n' +
        '1、打电话注销卡片，客服会和你说是优质客户，会在5天左右时间有专人联系你，然后过一两天，你去查额度，就会发现额度有所提高了。\n' +
        '2、冷冻你的信用卡，一般半年或者一年，额度自然增加。另外，获得白金信用卡办卡邀请的方法是冷冻你的信用卡一段时间后，直接去境外消费下，消费1-2万人民币即可，不需要等太久，你会收到办卡短信。',

        //建设
        js_title: '建设银行提额攻略',
        js: '1、 经常刷卡消费，次数越多越好，最好每个月刷完差不多所有额度。\n' +
        '2、 准时还款，留下良好的记录。\n' +
        '3、 经常分期付款，不过要支付一些手续费。\n' +
        '4、 经常在节假日致电银行临时调整额度以上几项有助于快速提高颌度，当然提高额度必须开卡满6个月。\n' +
        '5、 申请新的信用卡，申请购车贷款或房屋贷款，银行都会查看你的信用指数来决定给你什么样的利率和额度。指数高就可以得到更低的利率，更大的信用额度。使用建设银行龙卡信用卡消费以后，需要在规定的时间内向中国建设银行还款，还款的时候境内交易以人民币还款，境外交易可以美元还款或人民币购汇还款。可以凭卡片或凭卡号到全国各地的建设银行营业网点办理现金还款或转帐还款。无论同城、 异地，建设银行网点都可受理，并且无须手续费。\n' +
        '1、 网点还款可以实现用人民币现金归还人民币欠款、用美元现金归还美元欠款。\n' +
        '2、 转帐还款可以将借记卡、准贷记卡的资金转入信用卡账户进行还款。\n' +
        '3、 用人民币现金偿还人民币欠款、转帐还款可以到我行所有营业网点办理，用美元现金偿还美元欠款须到我行开办外币业务的营业网点办理。\n' +
        '4、 以美元以外的可兑换外汇还款时，应自行通过外汇买卖换汇，再以美元办理还款。\n' +
        '建设银行信用卡规则\n' +
        '建设银行在授信用卡透支额的时候，会根据申请人提供的个人资料来审核给定上线额度。也就是说申请人提供给建设银行的资料越详细全面，最后所给定的信用透支额度就会越高。\n' +
        '1.  建设银行普卡的授信额度一般为3000-10000元人民币之间，\n' +
        '2.  建设银行金卡的授信额度则定位10000-50000元人民币范围内。\n' +
        '3.  建设银行白金卡的授信额度一般都在5万元以上。\n' +
        '4.  建设银行信用卡取现额度最高能达到实际额度的30%\n' +
        '具体你所申请的卡片的额度主要还是根据你的资产状况来定，有车有房，收入也高，那么额度肯定不会低的。',

        //工商
        gs_title: '工商银行通用攻略：',
        gs: '工商银行通用攻略：\n' +
        '1. 多笔消费，比例25/2/1 25笔500元以下，2笔5000 左右，1笔达总卡额度百分之70。（额度太小或者额度较大具体对待）\n' +
        '2. 多元化不要总刷一个行业。\n' +
        '3. 偶尔有充刷和空刷。（充刷：先还款进去，再刷出来。 空刷：额度不够刷卡失败）\n' +
        '4. 刷境外和外币。\n' +
        '5. 和银行发生业务往来例如理财、流水、保险、存款代发工资等。\n' +
        '6. 硬件车、房等固定资产，有了就去银行进件。\n' +
        '7. 冷冻：长期不提额的卡，还完以后冷冻几个月不用（交行效果显著）\n' +
        '8. 销卡重申，例如某行长期不提，销卡后半年内，其他卡的额度上去了，再申请该行，下卡额度大大提高。（四大 行不要轻易销卡）\n' +
        '9. 曲线提额，持续申某行不同的卡种，有时候下卡额度 会高于现有额度。（建行效果显著）\n' +
        '10. 经常电话骚扰客服，要求提额，表功，诉苦找领导，威逼利诱，软磨硬泡。\n' +
        ' \n' +
        '工商银行特点：\n' +
        '1. 工商银行我排名第一，谓之卡种之王，原因只有一个， 太任性。它可以一下给你提上万倍的额度（当然起步点是 0.05元）。500-50000的百倍跳跃也是有的。实例1 :有位 卡友下卡1K ,放着一年多没用提到16K。\n' +
        '2.理论提额时间是3个月一提，但是没到三个月它抽风了 也能给你提。而且可以一提再提，比如你要提5万，他给你提了以后你马上打电话过去找个理由再提3万，也有可能成功。\n' +
        '3.工行是制定行用卡评分标准的银行，它可以不给其他银行面子，但是其他银行一定会给它面子，你有个工行十万卡护体，其他商业银行去申卡基本都会批卡而且额度都是8万以上。\n' +
        ' \n' +
        '攻略：\n' +
        '1.  刷星\n' +
        '1-1.玩工行刷星是起步，先刷双六星再去申请，事半功倍。\n' +
        '1-2.没基础建议不要直接刷到7星，有可能弄巧成拙。\n' +
        '1-3.建议额度上5W以后再7星，有助提额。\n' +
        '1-4.具体刷星方法有很多种，到处都有攻略。\n' +
        '1-  5.网银只能查服务星、贡献星是只有在银行才能查到的。\n' +
        '2.  代发工资\n' +
        '2-  1.工行顾名思义是工人的银行，它比较看中代发工资。\n' +
        '2-2.如果自己的公司不是工行代发的，可以去挂靠一个公司委托工行代发。（兼职不犯法）\n' +
        '2-3.实在不行就自己给自己发。用另外一个账户在每个月同一个时间打一笔同样金额的钱进你的储蓄卡。\n' +
        '(打款账户优势顺序：对公账户—他人个人账户—自己他行账户）\n' +
        '2-4.工行的额度是地方卡部可以决定的，不同地方申请的卡虽然额度是共享的，但是可以叠加调平。',

        //农业
        ny_title: '农业银行提额攻略',
        ny: '\n' +
        '由于某些历史原因，农行申卡成功率低，额度普遍偏低，而且提额很难，这已经成为卡右的一大共识。好多卡友咨询如何才能提高农行信用卡的额度，今天给大家分享下农行提额的最实用的几个技巧：\n' +
        '【技巧一：买定存】\n' +
        '信用卡提额前，到农行办理一笔小额的定期存款（五年期的），然后再打农行客服的电话申请提额，据了解，成功率高达95%，提额成功后定期存款的钱再取走就行！\n' +
        '所提升的额度跟你五年期的定期存款是成正比的！定期存款金额够大的话，你一万额度的卡提额十万也没问题！\n' +
        ' \n' +
        '【技巧二：买银行理财产品】\n' +
        '买理财产品，道理跟买定存差不多。\n' +
        '【技巧三：分期】\n' +
        '凡是能让银行赚到钱的信用卡持卡人，银行都会很喜欢。比如说，分期付款的消费方式，能让银行每个月尝到一点甜头（分期手续费和利息），提额申请，银行就会很容易通过。\n' +
        ' \n' +
        '【技巧四：亮出好单位】\n' +
        '银行一般都非常看重持卡人的工作单位，一些商业银行在重点大企业甚至设有专门的客服人员，这些企业的人在申请提额度的时候只要说明是正式员工，查证信用记录清白，上调几千块是非常容易的。好单位，比如国企、500强企业、集团公司等。\n' +
        ' \n' +
        '【技巧五：不要用最低还款额还款】\n' +
        '最低还款额还款，能让持卡人暂时没有后顾之忧，却也会让银行认为持卡人没有足够的资金实力。提额神马的请求，基本不会通过。过要提醒广大卡友：理性用卡，额度够用即可，过高的额度用不着不说，一旦丢失或被人盗刷，造成的损失也会更大。\n' +
        ' \n' +
        '农行养卡攻略，如何3月一次提额度\n' +
        ' \n' +
        '一：农行临时额度有剧毒，勿用  农行临时额度有效期2个月，这两个月若想再提固定额度，需要再等3个月。也就是说，农行的临时额度是占用额度提升周期的，和固定额度一样，用了一次就占用固定额度提升的时间，原本3个月提升，变成了5个月 \n' +
        '二：不要频繁打电话要求客服提额，你的征信报告上都是贷后管理。\n' +
        '只要是你电话申请提固定额度或者临时额度，每查询一次在你的征信报告上都会出现一次，之前看某论坛说，死命打，一个客服不管接着打，这个方式是错误的。你每次申请，就戳你的征信报告一针，频繁查询绝对会给你的征信报告减分。\n' +
        '   1502768802288167.png\n' +
        '\n' +
        '正确方式：请计算好你的提额周期，首次提额是6个月，之后每3个月一次固定，时间没到99%不提。如果首次也没有成功，那就是本月好好用卡，下个月到时间再来一次  \n' +
        '三：关于农行喜欢的消费习惯  关于各个银行，很多盆友都说，银行喜欢赚钱，给他分期供着他就行，但是分期完，有多少银行是提额的呢？农行也是一样，分期对于他不痛不痒，只需要规范用卡就可以。 \n' +
        '农行不需要刷爆，也不需要大额消费，保持正常的大小结合，账单占农行卡额度的20-30%就够了。\n' +
        '四：农行二卡额度不同，该如何调整\n' +
        '1502768802169125.png\n' +
        '题外话：农行、中行、交行、兴业、广发、中信、建行、光大等行，这些银行每申请一次卡都会查询你的征信报告，短期不频繁申请也可以接受。 \n' +
        '农行申请二卡，很多人下卡额度会比首卡额度高，这个时候需不需要调整呢？如果相差不是特别大，建议不要调平，一旦调平你的提额周期就按新卡的，再次提额需要6个月（大都是这个周期哈），推倒重来吧。 \n' +
        '正确方式：看你首卡离固定提额周期相差多远了，还差一两个月，那就等等，看首卡能不能按周期提升。额度参差不齐也不大碍，如果实在是不能首卡提额，那就调平吧 之前江湖还流传这样的方式不占用提额时间：那就是去领卡网点填提额表格，额度写上想要提额的额度，不知道目前可不可行，欢迎有时间的盆友肉测。  \n' +
        '五：关于农行系统评分综合评分不足  涉及很多，以为每次提额都要查征信，征信不良的就难提了；还有的看你消费方式，上面第三条也说明了；看你的资质，不要网申不要网申，拿下500党的实在不提固定，可用信用币调平，可以去柜台拿些证明申请二卡刷新银行档案，祝你成功吧，网上申请低额度的难提额。\n' +
        ' \n' +
        '关于农行提额和消费方式，差不多是以上这些，收集于自身经验、身边盆友提额经验以及论坛提额案例总结，并不是100%但是肯定有参考意义，祝大家养卡提额成功。\n' +
        '"\n',

        //光大
        gd_title: '光大银行养卡技巧',
        gd: '\n' +
        '光大银行养卡技巧\n' +
        '所谓养卡，就是通过一些""技术手段""，把信用卡额度提上去。一般来说，初始额度1万的信用卡养到5万的额度就自然〃毕业""了。如果手中有几张额度5万元的信用卡，总额 度也能达到几十万。那么，如何正确地养卡提额呢？下面， 就跟大家分享一些养卡的技巧。\n' +
        '1、 控制好刷卡的次数与金额\n' +
        '信用卡刷卡消费能够为银行贡献手续费收入，当然，要是有积分的消费，像批发、房产、网购这样的无积分交易尽量要少些，多在餐饮、娱乐等商户刷卡消费。信用卡刷卡次数多、 单月刷卡金额比例高的持卡人是较受银行欢迎的。一般而言， 一张卡每月消费次数要保持30笔以上，单月刷卡金额要超过总授信额度的60% ,申请提额容易获批。\n' +
        '2、 先提临额度度再提固定额度\n' +
        '倍用卡临时额度好提，而固定额度不好提，但是临时额度使用时间短，只能用一个月，到期就要全额还款。为了达到提升固定额度的目的，持卡人可以先申请临时额度，临时额度恰当使用和及时还款后再申请提升固定额度，容易获批。\n' +
        '3、 在发卡银行存一笔大额定期\n' +
        '在发卡银行有一笔定期存款，会让银行觉得你有足够的财力，可以负担较高的透支额度，透支消费后有能力还款，因此更愿意为你提升信用卡额度。\n' +
        '4、 购买发卡银行的理财产品\n' +
        '购买银行理财产品，帮助银行完成理财产品销售业绩，还能在某种程度上说明持卡人是有一定理财能力的客户，因此对于信用卡的使用会更合理，银行更愿意为你提升信用卡额度。\n' +
        '5、 境外消要对于倍用卡提额也有帮助\n' +
        '信用卡境外刷卡消费一般会有货币转换手续费等费用，以及汇兑差颔。这些也是银行在信用卡业务上的一项收入来源，因此会受到银行欢迎。\n' +
        '6、常做信用卡分期还款及取现信用卡分期还款和取现都有手续费，会为银行贡献收益，通过这种方式给了银行一点好处之后，提额自然更好办了。\n' +
        ' \n' +
        '信用卡提额15种最常见的方式：\n' +
        '1、次数取胜式提额\n' +
        '频繁使用信用卡，无论金额大小，只要能刷卡的地方就绝对 刷卡消费。有刷卡需求了、额度不足了，银行才可能考虑给 你提额；\n' +
        '2、 金额取胜式提额\n' +
        '最好每月产生帐单消要情况至少是总额度的30%以上。不然，反正你也不怎么使用，给你提额干嘛？\n' +
        '3、 临时提额式\n' +
        '因过节、旅游、出差等短期需要增加额度，可致电银行申请提临时额度，会较易审批；\n' +
        '4、 曲线提额式（作用较小）\n' +
        '曲线提额是指不断申请同一个银行的各种不同的信用卡。虽然额度共享，但这样申请提额的时候会有更高的把握；\n' +
        '5、 销卡威胁式提额（慎用）\n' +
        '致电发卡行，若不提升额度就销卡，有时会奏效。不过万一销卡被批准了呢？没关系，现在很多银行都会在你第一次申请销卡时给你一个月的宽限期，一个月内再有任意消费，销卡自动取消；\n' +
        '6、 持之以恒式提额\n' +
        '持续电话提额申请，有时对于不同的客服申请会得到不同的处理。当然，限制提额申请频率的银行除外；\n' +
        '7、 休眠暂停式提额\n' +
        '有意停用一段时间，银行为了圈地，对休眠卡的启用有一定的鼓励措施。不过不是所有的银行都适用；\n' +
        '8、 外汇交易式提额\n' +
        '如拥有外币消费能力，可选用外汇交易的形式，增加交易次数\n' +
        '9、 抓任时机式提额\n' +
        '提额的时间也很重要。在账单日或者在卡刚刚刷爆的时候申请，最为有效；\n' +
        '10、持续消费式提额\n' +
        '刷卡消费的帐单需连续3个月，中间不能断，即每月都要有消费；\n' +
        '11、补充资料式提额\n' +
        '补充更详细个人资料，提供更多资产证明。并且，按揭资产要比全额资产更能说明你的理财能力和借贷意识，也就更容易提升颌度；\n' +
        '12、最低还款式提额\n' +
        '致电发卡行说明最近需要用钱，并可让银行得到利息，根据以往信用良好等情况实现提额或者申请到万用金；\n' +
        '13、提升消费品位\n' +
        '经常去高尔夫球场、星级酒店、旅游公司等刷卡消费，银行会认为你的生活层次高，进而有更多的提额机会；\n' +
        '14、提前还款式提额\n' +
        '无需等到最后还款日，你可以选择提前还款，尽量缩短占用银行资金的时间，相当于绐银行减少了负担，银行自然更乐意给你提额的；\n' +
        '15、经常进行分期还款\n' +
        '经常分期还款，包括只支付手续费的分期还款和每月按最低还款额进行的最低还款。银行能从你这里赚取更多的手续费或利息，自然会乐意给你更高的额度。\n' +
        '申请提高永久额度的重要条件：\n' +
        '1、 金额数量尽量多，半年内每月消费金额至少在额度30%以上；\n' +
        '2、 消费次数尽量多，平均每月10笔以上，若20笔以上更易提额；\n' +
        '3、 消费商户类型多，诸如商场、超市、加油站、餐饮、 旅店、旅游、娱乐场所等；\n' +
        '4、 批发类和购房购车等大宗消费越少提额越容易提额；\n' +
        '5、 网上购物、支付宝交易及取现越少提高额度申请越易批核；\n' +
        '6、 刷卡的商户类型不能总是与所在公司的经营范围性质类似。\n' +
        '"\n',

        //广发
        gf_title: '广发银行养卡技巧',
        gf: '\n' +
        '广发银行养卡技巧\n' +
        '以卡养卡，就是A卡消费后，从B卡种来获得现金来还A 卡，等到B卡要还款了，再从A卡获得现金来还B卡，如此循环。信用卡以卡养卡，看起来似乎很简单，但是要注意的地方也还是不少，所以想要卡养得好，就得掌握一些养卡技巧。\n' +
        ' \n' +
        '想要以卡养卡，首先就得持有两张以上的信用卡，要提醒的是，以卡养卡没养好可是会沦为卡奴的，所以在养卡的过程中一定要按照下面的介绍操作。\n' +
        ' \n' +
        '1、 信用卡不宜过多\n' +
        '以卡养卡最好只用两张信用卡，这是因为只有两张卡的话，账单比较好算，管理起来也比较方便，而信用卡太多， 一来容易搞混账单日，二来养的卡多了很容易陷入死循环。\n' +
        '假设你有三张卡，每张卡都有账单，一开始还可以用卡A 还卡B ,再用卡B还卡C ,但是时间久了就会陷入死循环，要是资金链断了，就会面临巨大的还款压力，还不上就会逾期，影响个人信用。\n' +
        '2、 每张卡额度不要差太大\n' +
        '比如说你有两张信用卡，一张额度3000 , —张额度2万，要是一个不小心把2万额度的卡给刷爆了，想要用3000的卡来还2万的卡，这点额度自然是不够用的。\n' +
        '当然，可能你也会说，一张卡不够就再用几张卡来还， 殊不知，卡片再多但是额度小的话，还是有非常大的风险， 用多张卡来养一张大额卡，时间长了也是会陷入死循环的，还不上就等着逾期，影响个人信用吧。\n' +
        '3、 一定不要超额消费\n' +
        '以卡养卡，在刷卡的时候就要控制住自己的消费欲望，只买该买的东西，否则一旦消费超出自己的承受范围，就算有再多的卡，也不够你来养卡还款的，迟早会沦为卡奴。\n' +
        '4、 两张信用卡不能同时消要\n' +
        '以卡养卡最怕的就是两张信用卡同时消费，这样两张信用卡每个月都要还款，除非你工资超级高，不然肯定会还不起的。\n' +
        ' \n' +
        '广发银行信用卡积分规则是怎样的？下面为大家介绍。\n' +
        '根据广发信用卡中心的规定，使用广发信用卡消费签账，满人民币一元获得一分，满港币一元获得一分，满一美元可获得六分。消费赠多倍积分活动按照一美元获得六分计算多倍积分。\n' +
        '广发信用卡持卡人生日当月（自然月）刷卡消费z专享双倍积分。特殊卡类及特别活动分别依照该卡类积分规则、活动具体规则累计积分。\n' +
        '以下交易不计算积分：\n' +
        '1、 信用卡提现、转账交易，以及年费、提现手续费、存 /贷利息、超限费、积分換领自付金额、瞬时通、滞纳金等各项费用均不计算积分。\n' +
        '2、 低扣率、零扣率及特殊类型商户不计算积分，包括但不限于：房地产类、批发类、汽车销售类、博彩业、金融证券类支付、公用事业、医疗机构、政府机构、慈善及非盈利性机构、部分网上交易、帐篷和遮阳篷商店、院校类收费、\n' +
        '法律服务、电话费、保险费、纳税、代缴费业务及未列入其它代码的其他个人服务均不计算积分；\n' +
        '3、 积分计算以商户设置的交易类型为准，因商户设置的交易类型与实际经营类型不符导致不计算积分，本行不给予补赠。\n' +
        ' \n' +
        '同一持卡人，不同账户下同类型积分可以合并，并按照最高等级卡片档次换领，通过积分商城合并支付则按照同分行名下卡片的积分有效期先后顺序扣减积分。广发信用卡的主卡及附属卡、异型卡、虚拟卡的积分合并计于主卡账户中。\n' +
        '广发银行信用卡积分可通过消费或参与活动累计，积分有效期与所累计积分的卡片有效期一致。\n' +
        '"\n',

        //中国
        zg_title: '中国银行提额方法',
        zg: '\n' +
        '中国银行提额方法\n' +
        '信用卡申请之初，持卡人的信用额度都不是很高的，很多人一张卡用了很久还是初始的倍用额度。实际上呢，信用额度是可以提高的，随着收入、资产条件的提高，完全可以提高信用卡额度，以下八种方式助你成功信用卡提额。\n' +
        '1、 次数取胜\n' +
        '频繁使用信用卡，无论金额大小，只要能刷卡的地方就绝对刷卡消费。\n' +
        '2、 金额取胜\n' +
        '最好每月产生帐单消费情况至少是总额度的30%以上。\n' +
        '3、 临时提额\n' +
        '因过节、旅游、出差等短期需要增加额度，可申请提临时额度，会较易审批。\n' +
        '4、 持之以恒\n' +
        '持续电话提额申请，有时对于不同的客服申请会得到不同的处理。\n' +
        '5、 销卡威胁\n' +
        '若不提升额度就销卡，有时会奏效。\n' +
        '6、 休眠暂停\n' +
        '有意停用一个信用卡一定期限，银行为了圈地，对休眠卡的启用有一定的鼓励措施，诸如奖励提额。\n' +
        '7、 抓住时机\n' +
        '提额的时间也很重要。在账单日或者在卡刚刚刷爆的时候申请，最为有效。\n' +
        '8、 持续消费\n' +
        '刷卡消费的帐单需连续3个月，中间不能断，即每月都要有消费。\n' +
        '"\n',

        //兴业
        xy_title: '兴业银行提额方法',
        xy: '\n' +
        '兴业银行信用卡养卡技巧\n' +
        '刷好第一笔，多元化消费，真实消费，少套。按时还兴业银行的卡片要多点真实消费，少用鸡，养卡开商户15-20户左右， 一个月能有10到20笔之间，多刷优质商户。这个优质商户的定义包括银行特约商户和高端知名商户\n' +
        '倍用卡提额攻略：提额的关键在于下卡的第一个月第一笔怎么 刷，下卡第一笔就刷低费率或者低端商户或者套现。兴业银行提升固定额度最有效的方法是上传财力证明，房产证，车 证，大额存单等。之前有流传财力证明加上30W以上的流水证明，能申请一张十万以上额度的白金卡，维护好个人征信，\n' +
        '下卡后的第一笔要刷优质商户或者参与银行的活动\n' +
        '信用卡刷卡规则：\n' +
        '（1)    凡满足本细则第一条规定的持卡人兴业银行积分消费特约商户内使用本人名下的兴业银行信用卡进行积分消费。\n' +
        '（2)    持卡人进行积分消费时，卡内的积分按比例折算抵付消费金额，积分折算比例为：400积分=人民币 1元抵付的消费金额是1元的整数倍。\n' +
        '（3)    信用卡积分不足以完全抵付消要金额，或消费金额存在角和分时，即使持卡人账户内积分足够，不足以抵付的消费金额或消费金额中角和分的部分，仍须按一般刷卡消费从倌用卡中出账。\n' +
        '（4)    进行积分消要，需要在兴业银行专用POS机上刷卡，并在刷卡前告知收银员本次交易使用积分消费，刷卡成功后须在签购单上签字。\n' +
        '（5)    兴业银行保留变更积分折算比例的权利。\n' +
        '"\n',

        //民生
        ms_title: '民生银行提额方法',
        ms: '\n' +
        '民生信用卡提额攻略\n' +
        '首次申请提高额度需要使用信用卡满半年以上，保持良好的还款记录，方可申请。首次提额后需要过了6个月以后才可再次申请。对成功提额有帮助的消费方式有：\n' +
        '1.  刷卡金额数量尽量多，半年内消费总金额至少在额度3000以上；\n' +
        '2.  消费次数尽量多，平均每月10笔以上，达到20笔以上更易提额；\n' +
        '3.  消费商户类型多，诸如商场、超市、加油站、餐饮、旅店、 旅游、娱乐场所等；\n' +
        '4.  批发类和购房购车等大宗消费越少提额越容易；\n' +
        '5.  网上购物、支付宝交易及取现越少提高额度申请越易批核；\n' +
        '6.  刷卡的商户类型不能总是与所在公司的经营范围性质类似。\n' +
        '提额的小技巧：\n' +
        '1、 次数取胜，一定要频繁使用信用卡，不管金额大小，只要能刷卡的地方就绝不放过刷卡消费。\n' +
        '2、 金额取胜，最好每月产生帐单消费情况至少是总额度的 30%以上。\n' +
        '3、 临时提额，在重大节日、旅游、出差等短期需要增加额度，可申请提临时额度，会很容易审批。\n' +
        '4、 持之以恒，持续电话提额申请，有时对于不同的客服申请会得到不同的处理。\n' +
        '5、 持续消费，刷卡消费的帐单需连续3个月，中间不能断，即每月都要有消费。\n' +
        '6、 曲线提额式，曲线提额是指通过不断申请同一个银行的信用卡达到提高个人总额度的目的。\n' +
        '7、 外汇交易式提额，如拥有外币消费能力，可选用外汇交易的形式，增加交易次数。\n' +
        '"\n',

        //华夏
        hx_title: '华夏银行提额方法',
        hx: '\n' +
        '华夏银行养卡\n' +
        '信用卡养卡，就是有技巧地刷卡，积累良好的刷卡记录，并遵循银行信用卡提额的规则，逐渐提升信用卡额度的过程。信用卡刷卡养卡的目的是为了提升信用卡额度，把低额度信用卡变成大额信用卡，这样持卡人可使用的信用资金就多了，能够满足持卡人资金周转的需求。那么信用卡养卡有哪些技巧呢？\n' +
        '1、 每月刷到额度至少30%以上，并且刷卡的种类要细，大到家居装修、大型购物等，小到电费、话费缴费等，能想到可以刷卡的尽量刷卡，在免息还款日期间把钱还上即可。这样银行才会认为你有足够的消费能力和需求。\n' +
        '2、 如果你刷卡的钱无法一次性还清，切忌逾期还款，这样会给银行留下很不好的印象，最好的方法是申请账单分期还款，这个不算利息，但有手续费，账单分期是为了给银行一点""甜头""，你有钱给它赚它当然会给你良好记录（这里的良好记录指的是你频繁用卡并且没有逾期，这点对信用卡养卡很重要）。\n' +
        '3、时不时申请提额，这一步是在你保证前两步之后才可以做的。如果你平时几乎没有刷卡，也有过逾期，那银行几乎不可能给你提额，那么你要花在养卡的时间上就要更多了。\n' +
        '小编提醒：信用卡养卡是个需要时间和耐心的过程，切勿轻易相信一些""代养卡〃公司，其中要嘛收费贵，要嘛很大部分存在欺诈嫌疑。为了用卡安全， 最好还是用自己的方法来养卡。\n' +
        ' \n' +
        '提升额度：\n' +
        '1、 增加财产证明\n' +
        '信用卡激活使用至少3个月以上，最好有半年的使用记录，向银行提交申请时没有的房产证明、车辆证明 存款或理财证明等，直接提高自己的身价，再向银行申请提额，一般都很容易通过。\n' +
        '2、 高频率刷卡\n' +
        '想要向银行表示〃我经常用你们银行的卡""的最好方式，就是高频率的刷卡消费了。刷卡时尽量使用同一张卡，提高该卡的使用频率与消费金额，银行会提高你的忠诚度和综合评价，此时向银行申请提额，银行自然尽量满足。\n' +
        '3、 减少网购刷卡次数\n' +
        '对于大部分银行信用卡来说，网购使用信用卡支付既不能给予用户积分，也不能从中获得利润，更会增加信用卡资金转化风险，网购刷卡次数也不计入免年费的次数。若想要快速提额，那么就减少网购刷卡次数，银行是喜欢线下实体消费的。\n' +
        '4、 使用临时额度\n' +
        '—方面，银行希望给用户大额度信用卡拉动消费，另一方面，银行又担心信用卡账单收不回来。这种矛盾心理一直无法解决，临时额度就给银行和用户一个解决渠道。\n' +
        '在节假日、出差、旅游等时候，用户可向银行申请临时额度，既能满足客户的消费需求，也能满足银行的利益需求。而且临时额度申请方便，审批也很快，算是银行风控下给用户提额的一个有效解决方式。能多次使用临时额度并能按时还款的，自然是银行提额的首选。\n' +
        '临时额度唯一的缺陷是不享有信用循环，需要在还款日前一次还清。\n' +
        '5、 主动申请提额\n' +
        '在正常使用信用卡3个月以后，就能直接向银行申请提额了，当然银行会根据个人的用卡情况进行审核。连续三个月月均能刷到信用额度的30%以上，银行也会适当提高额度，若是每个月给的额度都用不了多少，银行会觉得给你提额没什么必要。\n' +
        '6、 保持良好信用记录\n' +
        '不管是信用卡审核还是贷款审核，个人征信都是绕不过的一个坎。所以想要信用卡提额成功，就要保持个人的良好信用记录，干万要珍惜良好的记录，不要因为一点小事造成逾期。消费时也要参考个人的还款能力，不要盲目消费，就算自己无法还完最低，及时向家人朋友求助，不要为了面子损失个人信用，一次逾期可能改变以后的生活。\n' +
        '刷卡规则：\n' +
        '多用于个人的日常刷卡消费，按期还款，多刷卡。\n' +
        '1.  按时全额还款，免利息；\n' +
        '2.  按时还最低还款，按日息万分之五收取；\n' +
        '3.  逾期还款，除上述利息外，还有滞纳金。\n' +
        '"\n',
      }
    },
    //页面设置转发功能
    onShareAppMessage: function (res) {
      return {
        title: `论下卡成功率，我没服过谁！`,
        imageUrl: 'http://download.pcuion.com/app2_0/songxianj.png',
        path: '/pages/index/index'
      }
    },
    created () {

      // this.nowNum = localStorage.getItem("watchNum");

      // this.watchNum =  Number(this.nowNum) + Number(RndNum(2));

      // localStorage.setItem('watchNum', this.watchNum);
    },
    methods: {
      tocardraidersdetails(titles,bankNum){
        // console.log(titles,bankNum)
        wx.navigateTo({ 
          url: "/pages/cardraidersdetails/main?title=" + titles + '&bankNo=' + bankNum
        });
      }, 
      // // 跳转到中间页
      // tokefu(title,url){
      //   let pages = getCurrentPages();
      //   let currPage = pages[pages.length - 1];   //当前页面
      //   let prevPage = pages[pages.length - 2];  //上一个页面
      //   currPage.setData({
      //     urlStr: url
      //   });
      //   wx.navigateTo({ 
      //       url: `/pages/link/main?title=${title}`
      //   });
      // },      
    },
  }
</script>
<style scoped lang='scss'>
.navTitle{
  width:100%;    
  height: 86rpx;
  line-height: 86rpx;
  text-align: center;
  font-size: 18px;
  color: #363636;
  border-bottom: 2rpx solid #C9C9C9;
  background:#fff;
}
.navTitle img{
  width: 24rpx;
  position: absolute;
  top: 20rpx;
  left: 5%;
}
.cardraiders{
  background: #F6F6F6;
  .header{
    text-align: center;
    padding: 40rpx;
    img{
        width: 100%;
    }  
  }
    
  .articleList{
    a:visited{
      color: #363636;
    }   
    .content{
      border:-2rpx(rgb(232, 232, 232));
      display: flex;
      justify-content: space-between;
      padding: 50rpx;
      background: #fff;
      .content_left{
        width: 60%;
        p:nth-of-type(1){
          color: #363636;
          font-size: 16px;
          /*font-family pingFangSC-Medium*/
        }
        
        p:nth-of-type(2){
          width: 100%;
          white-space: nowrap;
          text-overflow: ellipsis;
          overflow: hidden;
          font-size: 14px;
          color: #9a9a9a;
          margin: 20rpx 0;
          /*font-family pingFangSC-Medium*/
        }
          
        span{
          color: #9a9a9a;
          font-size: 12px;
          /*font-family pingFangSC-Medium*/
        }
          
        span:nth-of-type(2){
            margin-left: 100rpx;
          /*font-family pingFangSC-Medium*/
        }
          
      }   
      .content_right{
        width: 30%;
        img{
          width: 64%;
          margin-left: 40rpx;
        }      
      }    
    }     
  }    
 }    
</style>
